/*
2. Пользователь вводит с клавиатуры размер одного фильма в гигабайтах
и скорость Интернет-соединения в битах в секунду. Определить, за
какое время (часы, минуты и секунды) скачается фильм.
*/

#include<iostream>
#include <Windows.h>

using namespace std;

int main()
{
	setlocale(LC_ALL, ""); //працює тільки з потоком виведення
	SetConsoleCP(1251); //встановлює потрібну кодову таблицю, на потік введення
	SetConsoleOutputCP(1251); //встановлює потрібну кодову таблицю, на потік виводу

	return 0;
}
