/*
4. Пользователь вводит с клавиатуры количество студентов, сдавших
экзамен, и количество «должников». Посчитать, сколько процентов
составляют «должники» от общего числа студентов, а также, сколько
процентов составляют студенты, сдавшие экзамен.
*/

#include<iostream>
#include <Windows.h>

using namespace std;

int main()
{
	setlocale(LC_ALL, ""); //працює тільки з потоком виведення
	SetConsoleCP(1251); //встановлює потрібну кодову таблицю, на потік введення
	SetConsoleOutputCP(1251); //встановлює потрібну кодову таблицю, на потік виводу

	return 0;
}
